zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam3XXh-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <dt-bindings/pinctrl/atmel_sam_pinctrl.h>

/* pa0_gpio */
#define PA0_GPIO \
	SAM_PINMUX(a, 0, gpio, gpio)

/* pa0a_can0_tx */
#define PA0A_CAN0_TX \
	SAM_PINMUX(a, 0, a, periph)

/* pa0b_pwm_pwml3 */
#define PA0B_PWM_PWML3 \
	SAM_PINMUX(a, 0, b, periph)

/* pa1_gpio */
#define PA1_GPIO \
	SAM_PINMUX(a, 1, gpio, gpio)

/* pa1a_can0_rx */
#define PA1A_CAN0_RX \
	SAM_PINMUX(a, 1, a, periph)

/* pa1b_pmc_pck0 */
#define PA1B_PMC_PCK0 \
	SAM_PINMUX(a, 1, b, periph)

/* pa1x_supc_wkup0 */
#define PA1X_SUPC_WKUP0 \
	SAM_PINMUX(a, 1, x, extra)

/* pa2_gpio */
#define PA2_GPIO \
	SAM_PINMUX(a, 2, gpio, gpio)

/* pa2a_tc0_tioa1 */
#define PA2A_TC0_TIOA1 \
	SAM_PINMUX(a, 2, a, periph)

/* pa2b_ebi_nandrdy */
#define PA2B_EBI_NANDRDY \
	SAM_PINMUX(a, 2, b, periph)

/* pa2x_adc_ad0 */
#define PA2X_ADC_AD0 \
	SAM_PINMUX(a, 2, x, extra)

/* pa3_gpio */
#define PA3_GPIO \
	SAM_PINMUX(a, 3, gpio, gpio)

/* pa3a_tc0_tiob1 */
#define PA3A_TC0_TIOB1 \
	SAM_PINMUX(a, 3, a, periph)

/* pa3b_pwm_pwmfi1 */
#define PA3B_PWM_PWMFI1 \
	SAM_PINMUX(a, 3, b, periph)

/* pa3x_adc_ad1 */
#define PA3X_ADC_AD1 \
	SAM_PINMUX(a, 3, x, extra)

/* pa3x_supc_wkup1 */
#define PA3X_SUPC_WKUP1 \
	SAM_PINMUX(a, 3, x, extra)

/* pa4_gpio */
#define PA4_GPIO \
	SAM_PINMUX(a, 4, gpio, gpio)

/* pa4a_tc0_tclk1 */
#define PA4A_TC0_TCLK1 \
	SAM_PINMUX(a, 4, a, periph)

/* pa4b_ebi_nwait */
#define PA4B_EBI_NWAIT \
	SAM_PINMUX(a, 4, b, periph)

/* pa4x_adc_ad2 */
#define PA4X_ADC_AD2 \
	SAM_PINMUX(a, 4, x, extra)

/* pa5_gpio */
#define PA5_GPIO \
	SAM_PINMUX(a, 5, gpio, gpio)

/* pa5a_tc0_tioa2 */
#define PA5A_TC0_TIOA2 \
	SAM_PINMUX(a, 5, a, periph)

/* pa5b_pwm_pwmfi0 */
#define PA5B_PWM_PWMFI0 \
	SAM_PINMUX(a, 5, b, periph)

/* pa5x_supc_wkup2 */
#define PA5X_SUPC_WKUP2 \
	SAM_PINMUX(a, 5, x, extra)

/* pa6_gpio */
#define PA6_GPIO \
	SAM_PINMUX(a, 6, gpio, gpio)

/* pa6a_tc0_tiob2 */
#define PA6A_TC0_TIOB2 \
	SAM_PINMUX(a, 6, a, periph)

/* pa6b_ebi_ncs0 */
#define PA6B_EBI_NCS0 \
	SAM_PINMUX(a, 6, b, periph)

/* pa6x_adc_ad3 */
#define PA6X_ADC_AD3 \
	SAM_PINMUX(a, 6, x, extra)

/* pa7_gpio */
#define PA7_GPIO \
	SAM_PINMUX(a, 7, gpio, gpio)

/* pa7a_tc0_tclk2 */
#define PA7A_TC0_TCLK2 \
	SAM_PINMUX(a, 7, a, periph)

/* pa7b_ebi_ncs1 */
#define PA7B_EBI_NCS1 \
	SAM_PINMUX(a, 7, b, periph)

/* pa7x_supc_wkup3 */
#define PA7X_SUPC_WKUP3 \
	SAM_PINMUX(a, 7, x, extra)

/* pa8_gpio */
#define PA8_GPIO \
	SAM_PINMUX(a, 8, gpio, gpio)

/* pa8a_uart_rxd */
#define PA8A_UART_RXD \
	SAM_PINMUX(a, 8, a, periph)

/* pa8b_pwm_pwmh0 */
#define PA8B_PWM_PWMH0 \
	SAM_PINMUX(a, 8, b, periph)

/* pa8x_supc_wkup4 */
#define PA8X_SUPC_WKUP4 \
	SAM_PINMUX(a, 8, x, extra)

/* pa9_gpio */
#define PA9_GPIO \
	SAM_PINMUX(a, 9, gpio, gpio)

/* pa9a_uart_txd */
#define PA9A_UART_TXD \
	SAM_PINMUX(a, 9, a, periph)

/* pa9b_pwm_pwmh3 */
#define PA9B_PWM_PWMH3 \
	SAM_PINMUX(a, 9, b, periph)

/* pa10_gpio */
#define PA10_GPIO \
	SAM_PINMUX(a, 10, gpio, gpio)

/* pa10a_usart0_rxd */
#define PA10A_USART0_RXD \
	SAM_PINMUX(a, 10, a, periph)

/* pa10b_dacc_datrg */
#define PA10B_DACC_DATRG \
	SAM_PINMUX(a, 10, b, periph)

/* pa10x_supc_wkup5 */
#define PA10X_SUPC_WKUP5 \
	SAM_PINMUX(a, 10, x, extra)

/* pa11_gpio */
#define PA11_GPIO \
	SAM_PINMUX(a, 11, gpio, gpio)

/* pa11a_usart0_txd */
#define PA11A_USART0_TXD \
	SAM_PINMUX(a, 11, a, periph)

/* pa11b_adc_adtrg */
#define PA11B_ADC_ADTRG \
	SAM_PINMUX(a, 11, b, periph)

/* pa11x_supc_wkup6 */
#define PA11X_SUPC_WKUP6 \
	SAM_PINMUX(a, 11, x, extra)

/* pa12_gpio */
#define PA12_GPIO \
	SAM_PINMUX(a, 12, gpio, gpio)

/* pa12a_usart1_rxd */
#define PA12A_USART1_RXD \
	SAM_PINMUX(a, 12, a, periph)

/* pa12b_pwm_pwml1 */
#define PA12B_PWM_PWML1 \
	SAM_PINMUX(a, 12, b, periph)

/* pa12x_supc_wkup7 */
#define PA12X_SUPC_WKUP7 \
	SAM_PINMUX(a, 12, x, extra)

/* pa13_gpio */
#define PA13_GPIO \
	SAM_PINMUX(a, 13, gpio, gpio)

/* pa13a_usart1_txd */
#define PA13A_USART1_TXD \
	SAM_PINMUX(a, 13, a, periph)

/* pa13b_pwm_pwmh2 */
#define PA13B_PWM_PWMH2 \
	SAM_PINMUX(a, 13, b, periph)

/* pa14_gpio */
#define PA14_GPIO \
	SAM_PINMUX(a, 14, gpio, gpio)

/* pa14a_usart1_rts */
#define PA14A_USART1_RTS \
	SAM_PINMUX(a, 14, a, periph)

/* pa14b_ssc_tk */
#define PA14B_SSC_TK \
	SAM_PINMUX(a, 14, b, periph)

/* pa15_gpio */
#define PA15_GPIO \
	SAM_PINMUX(a, 15, gpio, gpio)

/* pa15a_usart1_cts */
#define PA15A_USART1_CTS \
	SAM_PINMUX(a, 15, a, periph)

/* pa15b_ssc_tf */
#define PA15B_SSC_TF \
	SAM_PINMUX(a, 15, b, periph)

/* pa15x_supc_wkup8 */
#define PA15X_SUPC_WKUP8 \
	SAM_PINMUX(a, 15, x, extra)

/* pa16_gpio */
#define PA16_GPIO \
	SAM_PINMUX(a, 16, gpio, gpio)

/* pa16a_spi1_spck1 */
#define PA16A_SPI1_SPCK1 \
	SAM_PINMUX(a, 16, a, periph)

/* pa16b_ssc_td */
#define PA16B_SSC_TD \
	SAM_PINMUX(a, 16, b, periph)

/* pa16x_adc_ad7 */
#define PA16X_ADC_AD7 \
	SAM_PINMUX(a, 16, x, extra)

/* pa17_gpio */
#define PA17_GPIO \
	SAM_PINMUX(a, 17, gpio, gpio)

/* pa17a_twi0_twd */
#define PA17A_TWI0_TWD \
	SAM_PINMUX(a, 17, a, periph)

/* pa17b_spi0_spck0 */
#define PA17B_SPI0_SPCK0 \
	SAM_PINMUX(a, 17, b, periph)

/* pa18_gpio */
#define PA18_GPIO \
	SAM_PINMUX(a, 18, gpio, gpio)

/* pa18a_twi0_twck */
#define PA18A_TWI0_TWCK \
	SAM_PINMUX(a, 18, a, periph)

/* pa18b_ebi_a20 */
#define PA18B_EBI_A20 \
	SAM_PINMUX(a, 18, b, periph)

/* pa18x_supc_wkup9 */
#define PA18X_SUPC_WKUP9 \
	SAM_PINMUX(a, 18, x, extra)

/* pa19_gpio */
#define PA19_GPIO \
	SAM_PINMUX(a, 19, gpio, gpio)

/* pa19a_hsmci_mcck */
#define PA19A_HSMCI_MCCK \
	SAM_PINMUX(a, 19, a, periph)

/* pa19b_pwm_pwmh1 */
#define PA19B_PWM_PWMH1 \
	SAM_PINMUX(a, 19, b, periph)

/* pa20_gpio */
#define PA20_GPIO \
	SAM_PINMUX(a, 20, gpio, gpio)

/* pa20a_hsmci_mccda */
#define PA20A_HSMCI_MCCDA \
	SAM_PINMUX(a, 20, a, periph)

/* pa20b_pwm_pwml2 */
#define PA20B_PWM_PWML2 \
	SAM_PINMUX(a, 20, b, periph)

/* pa21_gpio */
#define PA21_GPIO \
	SAM_PINMUX(a, 21, gpio, gpio)

/* pa21a_hsmci_mcda0 */
#define PA21A_HSMCI_MCDA0 \
	SAM_PINMUX(a, 21, a, periph)

/* pa21b_pwm_pwml0 */
#define PA21B_PWM_PWML0 \
	SAM_PINMUX(a, 21, b, periph)

/* pa22_gpio */
#define PA22_GPIO \
	SAM_PINMUX(a, 22, gpio, gpio)

