zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam3XXh-pinctrl.h
/* pa22a_hsmci_mcda1 */
#define PA22A_HSMCI_MCDA1 \
	SAM_PINMUX(a, 22, a, periph)

/* pa22b_tc1_tclk3 */
#define PA22B_TC1_TCLK3 \
	SAM_PINMUX(a, 22, b, periph)

/* pa22x_adc_ad4 */
#define PA22X_ADC_AD4 \
	SAM_PINMUX(a, 22, x, extra)

/* pa23_gpio */
#define PA23_GPIO \
	SAM_PINMUX(a, 23, gpio, gpio)

/* pa23a_hsmci_mcda2 */
#define PA23A_HSMCI_MCDA2 \
	SAM_PINMUX(a, 23, a, periph)

/* pa23b_tc1_tclk4 */
#define PA23B_TC1_TCLK4 \
	SAM_PINMUX(a, 23, b, periph)

/* pa23x_adc_ad5 */
#define PA23X_ADC_AD5 \
	SAM_PINMUX(a, 23, x, extra)

/* pa24_gpio */
#define PA24_GPIO \
	SAM_PINMUX(a, 24, gpio, gpio)

/* pa24a_hsmci_mcda3 */
#define PA24A_HSMCI_MCDA3 \
	SAM_PINMUX(a, 24, a, periph)

/* pa24b_pmc_pck1 */
#define PA24B_PMC_PCK1 \
	SAM_PINMUX(a, 24, b, periph)

/* pa24x_adc_ad6 */
#define PA24X_ADC_AD6 \
	SAM_PINMUX(a, 24, x, extra)

/* pa25_gpio */
#define PA25_GPIO \
	SAM_PINMUX(a, 25, gpio, gpio)

/* pa25a_spi0_miso */
#define PA25A_SPI0_MISO \
	SAM_PINMUX(a, 25, a, periph)

/* pa25b_ebi_a18 */
#define PA25B_EBI_A18 \
	SAM_PINMUX(a, 25, b, periph)

/* pa26_gpio */
#define PA26_GPIO \
	SAM_PINMUX(a, 26, gpio, gpio)

/* pa26a_spi0_mosi */
#define PA26A_SPI0_MOSI \
	SAM_PINMUX(a, 26, a, periph)

/* pa26b_ebi_a19 */
#define PA26B_EBI_A19 \
	SAM_PINMUX(a, 26, b, periph)

/* pa27_gpio */
#define PA27_GPIO \
	SAM_PINMUX(a, 27, gpio, gpio)

/* pa27a_spi0_spck */
#define PA27A_SPI0_SPCK \
	SAM_PINMUX(a, 27, a, periph)

/* pa27b_ebi_a20 */
#define PA27B_EBI_A20 \
	SAM_PINMUX(a, 27, b, periph)

/* pa27x_supc_wkup10 */
#define PA27X_SUPC_WKUP10 \
	SAM_PINMUX(a, 27, x, extra)

/* pa28_gpio */
#define PA28_GPIO \
	SAM_PINMUX(a, 28, gpio, gpio)

/* pa28a_spi0_npcs0 */
#define PA28A_SPI0_NPCS0 \
	SAM_PINMUX(a, 28, a, periph)

/* pa28b_pmc_pck2 */
#define PA28B_PMC_PCK2 \
	SAM_PINMUX(a, 28, b, periph)

/* pa28x_supc_wkup11 */
#define PA28X_SUPC_WKUP11 \
	SAM_PINMUX(a, 28, x, extra)

/* pa29_gpio */
#define PA29_GPIO \
	SAM_PINMUX(a, 29, gpio, gpio)

/* pa29a_spi0_npcs1 */
#define PA29A_SPI0_NPCS1 \
	SAM_PINMUX(a, 29, a, periph)

/* pa29b_ebi_nrd */
#define PA29B_EBI_NRD \
	SAM_PINMUX(a, 29, b, periph)

/* pa30_gpio */
#define PA30_GPIO \
	SAM_PINMUX(a, 30, gpio, gpio)

/* pa30a_spi0_npcs2 */
#define PA30A_SPI0_NPCS2 \
	SAM_PINMUX(a, 30, a, periph)

/* pa30b_pmc_pck1 */
#define PA30B_PMC_PCK1 \
	SAM_PINMUX(a, 30, b, periph)

/* pa31_gpio */
#define PA31_GPIO \
	SAM_PINMUX(a, 31, gpio, gpio)

/* pa31a_spi_npcs3 */
#define PA31A_SPI_NPCS3 \
	SAM_PINMUX(a, 31, a, periph)

/* pa31b_pmc_pck2 */
#define PA31B_PMC_PCK2 \
	SAM_PINMUX(a, 31, b, periph)

/* pb0_gpio */
#define PB0_GPIO \
	SAM_PINMUX(b, 0, gpio, gpio)

/* pb0a_emac_etxck_erefck */
#define PB0A_EMAC_ETXCK_EREFCK \
	SAM_PINMUX(b, 0, a, periph)

/* pb0b_tc1_tioa3 */
#define PB0B_TC1_TIOA3 \
	SAM_PINMUX(b, 0, b, periph)

/* pb1_gpio */
#define PB1_GPIO \
	SAM_PINMUX(b, 1, gpio, gpio)

/* pb1a_emac_etxen */
#define PB1A_EMAC_ETXEN \
	SAM_PINMUX(b, 1, a, periph)

/* pb1b_tc1_tiob3 */
#define PB1B_TC1_TIOB3 \
	SAM_PINMUX(b, 1, b, periph)

/* pb2_gpio */
#define PB2_GPIO \
	SAM_PINMUX(b, 2, gpio, gpio)

/* pb2a_emac_etx0 */
#define PB2A_EMAC_ETX0 \
	SAM_PINMUX(b, 2, a, periph)

/* pb2b_tc1_tioa4 */
#define PB2B_TC1_TIOA4 \
	SAM_PINMUX(b, 2, b, periph)

/* pb3_gpio */
#define PB3_GPIO \
	SAM_PINMUX(b, 3, gpio, gpio)

/* pb3a_emac_etx1 */
#define PB3A_EMAC_ETX1 \
	SAM_PINMUX(b, 3, a, periph)

/* pb3b_tc1_tiob4 */
#define PB3B_TC1_TIOB4 \
	SAM_PINMUX(b, 3, b, periph)

/* pb4_gpio */
#define PB4_GPIO \
	SAM_PINMUX(b, 4, gpio, gpio)

/* pb4a_emac_ecrsdv_erxdv */
#define PB4A_EMAC_ECRSDV_ERXDV \
	SAM_PINMUX(b, 4, a, periph)

/* pb4b_tc1_tioa5 */
#define PB4B_TC1_TIOA5 \
	SAM_PINMUX(b, 4, b, periph)

/* pb5_gpio */
#define PB5_GPIO \
	SAM_PINMUX(b, 5, gpio, gpio)

/* pb5a_emac_erx0 */
#define PB5A_EMAC_ERX0 \
	SAM_PINMUX(b, 5, a, periph)

/* pb5b_tc1_tiob5 */
#define PB5B_TC1_TIOB5 \
	SAM_PINMUX(b, 5, b, periph)

/* pb6_gpio */
#define PB6_GPIO \
	SAM_PINMUX(b, 6, gpio, gpio)

/* pb6a_emac_erx1 */
#define PB6A_EMAC_ERX1 \
	SAM_PINMUX(b, 6, a, periph)

/* pb6b_pwm_pwml4 */
#define PB6B_PWM_PWML4 \
	SAM_PINMUX(b, 6, b, periph)

/* pb7_gpio */
#define PB7_GPIO \
	SAM_PINMUX(b, 7, gpio, gpio)

/* pb7a_emac_erxer */
#define PB7A_EMAC_ERXER \
	SAM_PINMUX(b, 7, a, periph)

/* pb7b_pwm_pwml5 */
#define PB7B_PWM_PWML5 \
	SAM_PINMUX(b, 7, b, periph)

/* pb8_gpio */
#define PB8_GPIO \
	SAM_PINMUX(b, 8, gpio, gpio)

/* pb8a_emac_emdc */
#define PB8A_EMAC_EMDC \
	SAM_PINMUX(b, 8, a, periph)

/* pb8b_pwm_pwml6 */
#define PB8B_PWM_PWML6 \
	SAM_PINMUX(b, 8, b, periph)

/* pb9_gpio */
#define PB9_GPIO \
	SAM_PINMUX(b, 9, gpio, gpio)

/* pb9a_emac_emdio */
#define PB9A_EMAC_EMDIO \
	SAM_PINMUX(b, 9, a, periph)

/* pb9b_pwm_pwml7 */
#define PB9B_PWM_PWML7 \
	SAM_PINMUX(b, 9, b, periph)

/* pb10_gpio */
#define PB10_GPIO \
	SAM_PINMUX(b, 10, gpio, gpio)

/* pb10a_uotg_vbof */
#define PB10A_UOTG_VBOF \
	SAM_PINMUX(b, 10, a, periph)

/* pb10b_ebi_a18 */
#define PB10B_EBI_A18 \
	SAM_PINMUX(b, 10, b, periph)

/* pb11_gpio */
#define PB11_GPIO \
	SAM_PINMUX(b, 11, gpio, gpio)

/* pb11a_uotg_id */
#define PB11A_UOTG_ID \
	SAM_PINMUX(b, 11, a, periph)

/* pb11b_ebi_a19 */
#define PB11B_EBI_A19 \
	SAM_PINMUX(b, 11, b, periph)

/* pb12_gpio */
#define PB12_GPIO \
	SAM_PINMUX(b, 12, gpio, gpio)

/* pb12a_twi1_twd */
#define PB12A_TWI1_TWD \
	SAM_PINMUX(b, 12, a, periph)

/* pb12b_pwm_pwmh0 */
#define PB12B_PWM_PWMH0 \
	SAM_PINMUX(b, 12, b, periph)

/* pb12x_adc_ad8 */
#define PB12X_ADC_AD8 \
	SAM_PINMUX(b, 12, x, extra)

/* pb13_gpio */
#define PB13_GPIO \
	SAM_PINMUX(b, 13, gpio, gpio)

/* pb13a_twi1_twck */
#define PB13A_TWI1_TWCK \
	SAM_PINMUX(b, 13, a, periph)

/* pb13b_pwm_pwmh1 */
#define PB13B_PWM_PWMH1 \
	SAM_PINMUX(b, 13, b, periph)

/* pb13x_adc_ad9 */
#define PB13X_ADC_AD9 \
	SAM_PINMUX(b, 13, x, extra)

/* pb14_gpio */
#define PB14_GPIO \
	SAM_PINMUX(b, 14, gpio, gpio)

/* pb14a_can1_tx */
#define PB14A_CAN1_TX \
	SAM_PINMUX(b, 14, a, periph)

/* pb14b_pwm_pwmh2 */
#define PB14B_PWM_PWMH2 \
	SAM_PINMUX(b, 14, b, periph)

