zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam3XXh-pinctrl.h
/* pb15_gpio */
#define PB15_GPIO \
	SAM_PINMUX(b, 15, gpio, gpio)

/* pb15a_can1_rx */
#define PB15A_CAN1_RX \
	SAM_PINMUX(b, 15, a, periph)

/* pb15b_pwm_pwmh3 */
#define PB15B_PWM_PWMH3 \
	SAM_PINMUX(b, 15, b, periph)

/* pb15x_dacc_dac0 */
#define PB15X_DACC_DAC0 \
	SAM_PINMUX(b, 15, x, extra)

/* pb15x_supc_wkup10 */
#define PB15X_SUPC_WKUP10 \
	SAM_PINMUX(b, 15, x, extra)

/* pb16_gpio */
#define PB16_GPIO \
	SAM_PINMUX(b, 16, gpio, gpio)

/* pb16a_tc1_tclk5 */
#define PB16A_TC1_TCLK5 \
	SAM_PINMUX(b, 16, a, periph)

/* pb16b_pwm_pwml0 */
#define PB16B_PWM_PWML0 \
	SAM_PINMUX(b, 16, b, periph)

/* pb16x_dacc_dac1 */
#define PB16X_DACC_DAC1 \
	SAM_PINMUX(b, 16, x, extra)

/* pb17_gpio */
#define PB17_GPIO \
	SAM_PINMUX(b, 17, gpio, gpio)

/* pb17a_ssc_rf */
#define PB17A_SSC_RF \
	SAM_PINMUX(b, 17, a, periph)

/* pb17b_pwm_pwml1 */
#define PB17B_PWM_PWML1 \
	SAM_PINMUX(b, 17, b, periph)

/* pb17x_adc_ad10 */
#define PB17X_ADC_AD10 \
	SAM_PINMUX(b, 17, x, extra)

/* pb18_gpio */
#define PB18_GPIO \
	SAM_PINMUX(b, 18, gpio, gpio)

/* pb18a_ssc_rd */
#define PB18A_SSC_RD \
	SAM_PINMUX(b, 18, a, periph)

/* pb18b_pwm_pwml2 */
#define PB18B_PWM_PWML2 \
	SAM_PINMUX(b, 18, b, periph)

/* pb18x_adc_ad11 */
#define PB18X_ADC_AD11 \
	SAM_PINMUX(b, 18, x, extra)

/* pb19_gpio */
#define PB19_GPIO \
	SAM_PINMUX(b, 19, gpio, gpio)

/* pb19a_ssc_rk */
#define PB19A_SSC_RK \
	SAM_PINMUX(b, 19, a, periph)

/* pb19b_pwm_pwml3 */
#define PB19B_PWM_PWML3 \
	SAM_PINMUX(b, 19, b, periph)

/* pb19x_adc_ad12 */
#define PB19X_ADC_AD12 \
	SAM_PINMUX(b, 19, x, extra)

/* pb20_gpio */
#define PB20_GPIO \
	SAM_PINMUX(b, 20, gpio, gpio)

/* pb20a_usart2_txd */
#define PB20A_USART2_TXD \
	SAM_PINMUX(b, 20, a, periph)

/* pb20b_spi0_npcs1 */
#define PB20B_SPI0_NPCS1 \
	SAM_PINMUX(b, 20, b, periph)

/* pb20x_adc_ad13 */
#define PB20X_ADC_AD13 \
	SAM_PINMUX(b, 20, x, extra)

/* pb21_gpio */
#define PB21_GPIO \
	SAM_PINMUX(b, 21, gpio, gpio)

/* pb21a_usart2_rxd */
#define PB21A_USART2_RXD \
	SAM_PINMUX(b, 21, a, periph)

/* pb21b_spi0_npcs2 */
#define PB21B_SPI0_NPCS2 \
	SAM_PINMUX(b, 21, b, periph)

/* pb21x_adc_ad14 */
#define PB21X_ADC_AD14 \
	SAM_PINMUX(b, 21, x, extra)

/* pb21x_supc_wkup13 */
#define PB21X_SUPC_WKUP13 \
	SAM_PINMUX(b, 21, x, extra)

/* pb22_gpio */
#define PB22_GPIO \
	SAM_PINMUX(b, 22, gpio, gpio)

/* pb22a_usart2_rts */
#define PB22A_USART2_RTS \
	SAM_PINMUX(b, 22, a, periph)

/* pb22b_pmc_pck0 */
#define PB22B_PMC_PCK0 \
	SAM_PINMUX(b, 22, b, periph)

/* pb23_gpio */
#define PB23_GPIO \
	SAM_PINMUX(b, 23, gpio, gpio)

/* pb23a_usart2_cts */
#define PB23A_USART2_CTS \
	SAM_PINMUX(b, 23, a, periph)

/* pb23b_spi0_npcs3 */
#define PB23B_SPI0_NPCS3 \
	SAM_PINMUX(b, 23, b, periph)

/* pb23x_supc_wkup14 */
#define PB23X_SUPC_WKUP14 \
	SAM_PINMUX(b, 23, x, extra)

/* pb24_gpio */
#define PB24_GPIO \
	SAM_PINMUX(b, 24, gpio, gpio)

/* pb24a_usart2_sck */
#define PB24A_USART2_SCK \
	SAM_PINMUX(b, 24, a, periph)

/* pb24b_ebi_ncs2 */
#define PB24B_EBI_NCS2 \
	SAM_PINMUX(b, 24, b, periph)

/* pb25_gpio */
#define PB25_GPIO \
	SAM_PINMUX(b, 25, gpio, gpio)

/* pb25a_usart0_rts */
#define PB25A_USART0_RTS \
	SAM_PINMUX(b, 25, a, periph)

/* pb25b_tc0_tioa0 */
#define PB25B_TC0_TIOA0 \
	SAM_PINMUX(b, 25, b, periph)

/* pb26_gpio */
#define PB26_GPIO \
	SAM_PINMUX(b, 26, gpio, gpio)

/* pb26a_usart0_cts */
#define PB26A_USART0_CTS \
	SAM_PINMUX(b, 26, a, periph)

/* pb26b_tc0_tclk0 */
#define PB26B_TC0_TCLK0 \
	SAM_PINMUX(b, 26, b, periph)

/* pb26x_supc_wkup15 */
#define PB26X_SUPC_WKUP15 \
	SAM_PINMUX(b, 26, x, extra)

/* pb27_gpio */
#define PB27_GPIO \
	SAM_PINMUX(b, 27, gpio, gpio)

/* pb27a_ebi_ncs3 */
#define PB27A_EBI_NCS3 \
	SAM_PINMUX(b, 27, a, periph)

/* pb27b_tc0_tiob0 */
#define PB27B_TC0_TIOB0 \
	SAM_PINMUX(b, 27, b, periph)

/* pb28_gpio */
#define PB28_GPIO \
	SAM_PINMUX(b, 28, gpio, gpio)

/* pb29_gpio */
#define PB29_GPIO \
	SAM_PINMUX(b, 29, gpio, gpio)

/* pb30_gpio */
#define PB30_GPIO \
	SAM_PINMUX(b, 30, gpio, gpio)

/* pb31_gpio */
#define PB31_GPIO \
	SAM_PINMUX(b, 31, gpio, gpio)

/* pc0_gpio */
#define PC0_GPIO \
	SAM_PINMUX(c, 0, gpio, gpio)

/* pc0x_flash_erase */
#define PC0X_FLASH_ERASE \
	SAM_PINMUX(c, 0, x, extra)

/* pc1_gpio */
#define PC1_GPIO \
	SAM_PINMUX(c, 1, gpio, gpio)

/* pc2_gpio */
#define PC2_GPIO \
	SAM_PINMUX(c, 2, gpio, gpio)

/* pc2a_ebi_d0 */
#define PC2A_EBI_D0 \
	SAM_PINMUX(c, 2, a, periph)

/* pc2b_pwm_pwml0 */
#define PC2B_PWM_PWML0 \
	SAM_PINMUX(c, 2, b, periph)

/* pc3_gpio */
#define PC3_GPIO \
	SAM_PINMUX(c, 3, gpio, gpio)

/* pc3a_ebi_d1 */
#define PC3A_EBI_D1 \
	SAM_PINMUX(c, 3, a, periph)

/* pc3b_pwm_pwmh0 */
#define PC3B_PWM_PWMH0 \
	SAM_PINMUX(c, 3, b, periph)

/* pc4_gpio */
#define PC4_GPIO \
	SAM_PINMUX(c, 4, gpio, gpio)

/* pc4a_ebi_d2 */
#define PC4A_EBI_D2 \
	SAM_PINMUX(c, 4, a, periph)

/* pc4b_pwm_pwml1 */
#define PC4B_PWM_PWML1 \
	SAM_PINMUX(c, 4, b, periph)

/* pc5_gpio */
#define PC5_GPIO \
	SAM_PINMUX(c, 5, gpio, gpio)

/* pc5a_ebi_d3 */
#define PC5A_EBI_D3 \
	SAM_PINMUX(c, 5, a, periph)

/* pc5b_pwm_pwmh1 */
#define PC5B_PWM_PWMH1 \
	SAM_PINMUX(c, 5, b, periph)

/* pc6_gpio */
#define PC6_GPIO \
	SAM_PINMUX(c, 6, gpio, gpio)

/* pc6a_ebi_d4 */
#define PC6A_EBI_D4 \
	SAM_PINMUX(c, 6, a, periph)

/* pc6b_pwm_pwml2 */
#define PC6B_PWM_PWML2 \
	SAM_PINMUX(c, 6, b, periph)

/* pc7_gpio */
#define PC7_GPIO \
	SAM_PINMUX(c, 7, gpio, gpio)

/* pc7a_ebi_d5 */
#define PC7A_EBI_D5 \
	SAM_PINMUX(c, 7, a, periph)

/* pc7b_pwm_pwmh2 */
#define PC7B_PWM_PWMH2 \
	SAM_PINMUX(c, 7, b, periph)

/* pc8_gpio */
#define PC8_GPIO \
	SAM_PINMUX(c, 8, gpio, gpio)

/* pc8a_ebi_d6 */
#define PC8A_EBI_D6 \
	SAM_PINMUX(c, 8, a, periph)

/* pc8b_pwm_pwml3 */
#define PC8B_PWM_PWML3 \
	SAM_PINMUX(c, 8, b, periph)

/* pc9_gpio */
#define PC9_GPIO \
	SAM_PINMUX(c, 9, gpio, gpio)

/* pc9a_ebi_d7 */
#define PC9A_EBI_D7 \
	SAM_PINMUX(c, 9, a, periph)

/* pc9b_pwm_pwmh3 */
#define PC9B_PWM_PWMH3 \
	SAM_PINMUX(c, 9, b, periph)

/* pc10_gpio */
#define PC10_GPIO \
	SAM_PINMUX(c, 10, gpio, gpio)

/* pc10a_ebi_d8 */
#define PC10A_EBI_D8 \
	SAM_PINMUX(c, 10, a, periph)

/* pc10b_emac_ecrs */
#define PC10B_EMAC_ECRS \
	SAM_PINMUX(c, 10, b, periph)

