zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam3XXh-pinctrl.h
/* pc11_gpio */
#define PC11_GPIO \
	SAM_PINMUX(c, 11, gpio, gpio)

/* pc11a_ebi_d9 */
#define PC11A_EBI_D9 \
	SAM_PINMUX(c, 11, a, periph)

/* pc11b_emac_erx2 */
#define PC11B_EMAC_ERX2 \
	SAM_PINMUX(c, 11, b, periph)

/* pc12_gpio */
#define PC12_GPIO \
	SAM_PINMUX(c, 12, gpio, gpio)

/* pc12a_ebi_d10 */
#define PC12A_EBI_D10 \
	SAM_PINMUX(c, 12, a, periph)

/* pc12b_emac_erx3 */
#define PC12B_EMAC_ERX3 \
	SAM_PINMUX(c, 12, b, periph)

/* pc13_gpio */
#define PC13_GPIO \
	SAM_PINMUX(c, 13, gpio, gpio)

/* pc13a_ebi_d11 */
#define PC13A_EBI_D11 \
	SAM_PINMUX(c, 13, a, periph)

/* pc13b_emac_ecol */
#define PC13B_EMAC_ECOL \
	SAM_PINMUX(c, 13, b, periph)

/* pc14_gpio */
#define PC14_GPIO \
	SAM_PINMUX(c, 14, gpio, gpio)

/* pc14a_ebi_d12 */
#define PC14A_EBI_D12 \
	SAM_PINMUX(c, 14, a, periph)

/* pc14b_emac_erxck */
#define PC14B_EMAC_ERXCK \
	SAM_PINMUX(c, 14, b, periph)

/* pc15_gpio */
#define PC15_GPIO \
	SAM_PINMUX(c, 15, gpio, gpio)

/* pc15a_ebi_d13 */
#define PC15A_EBI_D13 \
	SAM_PINMUX(c, 15, a, periph)

/* pc15b_emac_etx2 */
#define PC15B_EMAC_ETX2 \
	SAM_PINMUX(c, 15, b, periph)

/* pc16_gpio */
#define PC16_GPIO \
	SAM_PINMUX(c, 16, gpio, gpio)

/* pc16a_ebi_d14 */
#define PC16A_EBI_D14 \
	SAM_PINMUX(c, 16, a, periph)

/* pc16b_emac_etx3 */
#define PC16B_EMAC_ETX3 \
	SAM_PINMUX(c, 16, b, periph)

/* pc17_gpio */
#define PC17_GPIO \
	SAM_PINMUX(c, 17, gpio, gpio)

/* pc17a_ebi_d15 */
#define PC17A_EBI_D15 \
	SAM_PINMUX(c, 17, a, periph)

/* pc17b_emac_etxer */
#define PC17B_EMAC_ETXER \
	SAM_PINMUX(c, 17, b, periph)

/* pc18_gpio */
#define PC18_GPIO \
	SAM_PINMUX(c, 18, gpio, gpio)

/* pc18a_ebi_nwr0_nwe */
#define PC18A_EBI_NWR0_NWE \
	SAM_PINMUX(c, 18, a, periph)

/* pc18b_pwm_pwmh6 */
#define PC18B_PWM_PWMH6 \
	SAM_PINMUX(c, 18, b, periph)

/* pc19_gpio */
#define PC19_GPIO \
	SAM_PINMUX(c, 19, gpio, gpio)

/* pc19a_ebi_nandoe */
#define PC19A_EBI_NANDOE \
	SAM_PINMUX(c, 19, a, periph)

/* pc19b_pwm_pwmh5 */
#define PC19B_PWM_PWMH5 \
	SAM_PINMUX(c, 19, b, periph)

/* pc20_gpio */
#define PC20_GPIO \
	SAM_PINMUX(c, 20, gpio, gpio)

/* pc20a_ebi_nandwe */
#define PC20A_EBI_NANDWE \
	SAM_PINMUX(c, 20, a, periph)

/* pc20b_pwm_pwmh4 */
#define PC20B_PWM_PWMH4 \
	SAM_PINMUX(c, 20, b, periph)

/* pc21_gpio */
#define PC21_GPIO \
	SAM_PINMUX(c, 21, gpio, gpio)

/* pc21a_ebi_a0_nbs0 */
#define PC21A_EBI_A0_NBS0 \
	SAM_PINMUX(c, 21, a, periph)

/* pc21b_pwm_pwml4 */
#define PC21B_PWM_PWML4 \
	SAM_PINMUX(c, 21, b, periph)

/* pc22_gpio */
#define PC22_GPIO \
	SAM_PINMUX(c, 22, gpio, gpio)

/* pc22a_ebi_a1 */
#define PC22A_EBI_A1 \
	SAM_PINMUX(c, 22, a, periph)

/* pc22b_pwm_pwml5 */
#define PC22B_PWM_PWML5 \
	SAM_PINMUX(c, 22, b, periph)

/* pc23_gpio */
#define PC23_GPIO \
	SAM_PINMUX(c, 23, gpio, gpio)

/* pc23a_ebi_a2 */
#define PC23A_EBI_A2 \
	SAM_PINMUX(c, 23, a, periph)

/* pc23b_pwm_pwml6 */
#define PC23B_PWM_PWML6 \
	SAM_PINMUX(c, 23, b, periph)

/* pc24_gpio */
#define PC24_GPIO \
	SAM_PINMUX(c, 24, gpio, gpio)

/* pc24a_ebi_a3 */
#define PC24A_EBI_A3 \
	SAM_PINMUX(c, 24, a, periph)

/* pc24b_pwm_pwml7 */
#define PC24B_PWM_PWML7 \
	SAM_PINMUX(c, 24, b, periph)

/* pc25_gpio */
#define PC25_GPIO \
	SAM_PINMUX(c, 25, gpio, gpio)

/* pc25a_ebi_a4 */
#define PC25A_EBI_A4 \
	SAM_PINMUX(c, 25, a, periph)

/* pc25b_tc2_tioa6 */
#define PC25B_TC2_TIOA6 \
	SAM_PINMUX(c, 25, b, periph)

/* pc26_gpio */
#define PC26_GPIO \
	SAM_PINMUX(c, 26, gpio, gpio)

/* pc26a_ebi_a5 */
#define PC26A_EBI_A5 \
	SAM_PINMUX(c, 26, a, periph)

/* pc26b_tc2_tiob6 */
#define PC26B_TC2_TIOB6 \
	SAM_PINMUX(c, 26, b, periph)

/* pc27_gpio */
#define PC27_GPIO \
	SAM_PINMUX(c, 27, gpio, gpio)

/* pc27a_ebi_a6 */
#define PC27A_EBI_A6 \
	SAM_PINMUX(c, 27, a, periph)

/* pc27b_tc2_tclk6 */
#define PC27B_TC2_TCLK6 \
	SAM_PINMUX(c, 27, b, periph)

/* pc28_gpio */
#define PC28_GPIO \
	SAM_PINMUX(c, 28, gpio, gpio)

/* pc28a_ebi_a7 */
#define PC28A_EBI_A7 \
	SAM_PINMUX(c, 28, a, periph)

/* pc28b_tc2_tioa7 */
#define PC28B_TC2_TIOA7 \
	SAM_PINMUX(c, 28, b, periph)

/* pc29_gpio */
#define PC29_GPIO \
	SAM_PINMUX(c, 29, gpio, gpio)

/* pc29a_ebi_a8 */
#define PC29A_EBI_A8 \
	SAM_PINMUX(c, 29, a, periph)

/* pc29b_tc2_tiob7 */
#define PC29B_TC2_TIOB7 \
	SAM_PINMUX(c, 29, b, periph)

/* pc30_gpio */
#define PC30_GPIO \
	SAM_PINMUX(c, 30, gpio, gpio)

/* pc30a_ebi_a9 */
#define PC30A_EBI_A9 \
	SAM_PINMUX(c, 30, a, periph)

/* pc30b_tc2_tclk7 */
#define PC30B_TC2_TCLK7 \
	SAM_PINMUX(c, 30, b, periph)

/* pd0_gpio */
#define PD0_GPIO \
	SAM_PINMUX(d, 0, gpio, gpio)

/* pd0a_ebi_a10 */
#define PD0A_EBI_A10 \
	SAM_PINMUX(d, 0, a, periph)

/* pd0b_hsmci_mcda4 */
#define PD0B_HSMCI_MCDA4 \
	SAM_PINMUX(d, 0, b, periph)

/* pd1_gpio */
#define PD1_GPIO \
	SAM_PINMUX(d, 1, gpio, gpio)

/* pd1a_ebi_a11 */
#define PD1A_EBI_A11 \
	SAM_PINMUX(d, 1, a, periph)

/* pd1b_hsmci_mcda5 */
#define PD1B_HSMCI_MCDA5 \
	SAM_PINMUX(d, 1, b, periph)

/* pd2_gpio */
#define PD2_GPIO \
	SAM_PINMUX(d, 2, gpio, gpio)

/* pd2a_ebi_a12 */
#define PD2A_EBI_A12 \
	SAM_PINMUX(d, 2, a, periph)

/* pd2b_hsmci_mcda6 */
#define PD2B_HSMCI_MCDA6 \
	SAM_PINMUX(d, 2, b, periph)

/* pd3_gpio */
#define PD3_GPIO \
	SAM_PINMUX(d, 3, gpio, gpio)

/* pd3a_ebi_a13 */
#define PD3A_EBI_A13 \
	SAM_PINMUX(d, 3, a, periph)

/* pd3b_hsmci_mcda7 */
#define PD3B_HSMCI_MCDA7 \
	SAM_PINMUX(d, 3, b, periph)

/* pd4_gpio */
#define PD4_GPIO \
	SAM_PINMUX(d, 4, gpio, gpio)

/* pd4a_ebi_a14 */
#define PD4A_EBI_A14 \
	SAM_PINMUX(d, 4, a, periph)

/* pd4b_usart3_txd */
#define PD4B_USART3_TXD \
	SAM_PINMUX(d, 4, b, periph)

/* pd5_gpio */
#define PD5_GPIO \
	SAM_PINMUX(d, 5, gpio, gpio)

/* pd5a_ebi_a15 */
#define PD5A_EBI_A15 \
	SAM_PINMUX(d, 5, a, periph)

/* pd5b_usart3_rxd */
#define PD5B_USART3_RXD \
	SAM_PINMUX(d, 5, b, periph)

/* pd6_gpio */
#define PD6_GPIO \
	SAM_PINMUX(d, 6, gpio, gpio)

/* pd6a_ebi_a16_ba0 */
#define PD6A_EBI_A16_BA0 \
	SAM_PINMUX(d, 6, a, periph)

/* pd6b_pwm_pwmfi2 */
#define PD6B_PWM_PWMFI2 \
	SAM_PINMUX(d, 6, b, periph)

/* pd7_gpio */
#define PD7_GPIO \
	SAM_PINMUX(d, 7, gpio, gpio)

