zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam3XXh-pinctrl.h
/* pd7a_ebi_a17_ba1 */
#define PD7A_EBI_A17_BA1 \
	SAM_PINMUX(d, 7, a, periph)

/* pd7b_tc2_tioa8 */
#define PD7B_TC2_TIOA8 \
	SAM_PINMUX(d, 7, b, periph)

/* pd8_gpio */
#define PD8_GPIO \
	SAM_PINMUX(d, 8, gpio, gpio)

/* pd8a_ebi_a21_nandale */
#define PD8A_EBI_A21_NANDALE \
	SAM_PINMUX(d, 8, a, periph)

/* pd8b_tc2_tiob8 */
#define PD8B_TC2_TIOB8 \
	SAM_PINMUX(d, 8, b, periph)

/* pd9_gpio */
#define PD9_GPIO \
	SAM_PINMUX(d, 9, gpio, gpio)

/* pd9a_ebi_a22_nandcle */
#define PD9A_EBI_A22_NANDCLE \
	SAM_PINMUX(d, 9, a, periph)

/* pd9b_tc2_tclk9 */
#define PD9B_TC2_TCLK9 \
	SAM_PINMUX(d, 9, b, periph)

/* pd10_gpio */
#define PD10_GPIO \
	SAM_PINMUX(d, 10, gpio, gpio)

/* pd10a_ebi_nwr1_nbs1 */
#define PD10A_EBI_NWR1_NBS1 \
	SAM_PINMUX(d, 10, a, periph)

/* pd11_gpio */
#define PD11_GPIO \
	SAM_PINMUX(d, 11, gpio, gpio)

/* pd11a_ebi_sda10 */
#define PD11A_EBI_SDA10 \
	SAM_PINMUX(d, 11, a, periph)

/* pd12_gpio */
#define PD12_GPIO \
	SAM_PINMUX(d, 12, gpio, gpio)

/* pd12a_ebi_sdcs */
#define PD12A_EBI_SDCS \
	SAM_PINMUX(d, 12, a, periph)

/* pd13_gpio */
#define PD13_GPIO \
	SAM_PINMUX(d, 13, gpio, gpio)

/* pd13a_ebi_sdcke */
#define PD13A_EBI_SDCKE \
	SAM_PINMUX(d, 13, a, periph)

/* pd14_gpio */
#define PD14_GPIO \
	SAM_PINMUX(d, 14, gpio, gpio)

/* pd14a_ebi_sdwe */
#define PD14A_EBI_SDWE \
	SAM_PINMUX(d, 14, a, periph)

/* pd15_gpio */
#define PD15_GPIO \
	SAM_PINMUX(d, 15, gpio, gpio)

/* pd15a_ebi_ras */
#define PD15A_EBI_RAS \
	SAM_PINMUX(d, 15, a, periph)

/* pd16_gpio */
#define PD16_GPIO \
	SAM_PINMUX(d, 16, gpio, gpio)

/* pd16a_ebi_cas */
#define PD16A_EBI_CAS \
	SAM_PINMUX(d, 16, a, periph)

/* pd17_gpio */
#define PD17_GPIO \
	SAM_PINMUX(d, 17, gpio, gpio)

/* pd17a_ebi_a5 */
#define PD17A_EBI_A5 \
	SAM_PINMUX(d, 17, a, periph)

/* pd18_gpio */
#define PD18_GPIO \
	SAM_PINMUX(d, 18, gpio, gpio)

/* pd18a_ebi_a6 */
#define PD18A_EBI_A6 \
	SAM_PINMUX(d, 18, a, periph)

/* pd19_gpio */
#define PD19_GPIO \
	SAM_PINMUX(d, 19, gpio, gpio)

/* pd19a_ebi_a7 */
#define PD19A_EBI_A7 \
	SAM_PINMUX(d, 19, a, periph)

/* pd20_gpio */
#define PD20_GPIO \
	SAM_PINMUX(d, 20, gpio, gpio)

/* pd20a_ebi_a8 */
#define PD20A_EBI_A8 \
	SAM_PINMUX(d, 20, a, periph)

/* pd21_gpio */
#define PD21_GPIO \
	SAM_PINMUX(d, 21, gpio, gpio)

/* pd21a_ebi_a9 */
#define PD21A_EBI_A9 \
	SAM_PINMUX(d, 21, a, periph)

/* pd22_gpio */
#define PD22_GPIO \
	SAM_PINMUX(d, 22, gpio, gpio)

/* pd22a_ebi_a10 */
#define PD22A_EBI_A10 \
	SAM_PINMUX(d, 22, a, periph)

/* pd23_gpio */
#define PD23_GPIO \
	SAM_PINMUX(d, 23, gpio, gpio)

/* pd23a_ebi_a11 */
#define PD23A_EBI_A11 \
	SAM_PINMUX(d, 23, a, periph)

/* pd24_gpio */
#define PD24_GPIO \
	SAM_PINMUX(d, 24, gpio, gpio)

/* pd24a_ebi_a12 */
#define PD24A_EBI_A12 \
	SAM_PINMUX(d, 24, a, periph)

/* pd25_gpio */
#define PD25_GPIO \
	SAM_PINMUX(d, 25, gpio, gpio)

/* pd25a_ebi_a13 */
#define PD25A_EBI_A13 \
	SAM_PINMUX(d, 25, a, periph)

/* pd26_gpio */
#define PD26_GPIO \
	SAM_PINMUX(d, 26, gpio, gpio)

/* pd26a_ebi_a14 */
#define PD26A_EBI_A14 \
	SAM_PINMUX(d, 26, a, periph)

/* pd27_gpio */
#define PD27_GPIO \
	SAM_PINMUX(d, 27, gpio, gpio)

/* pd27a_ebi_a15 */
#define PD27A_EBI_A15 \
	SAM_PINMUX(d, 27, a, periph)

/* pd28_gpio */
#define PD28_GPIO \
	SAM_PINMUX(d, 28, gpio, gpio)

/* pd28a_ebi_a16_ba0 */
#define PD28A_EBI_A16_BA0 \
	SAM_PINMUX(d, 28, a, periph)

/* pd29_gpio */
#define PD29_GPIO \
	SAM_PINMUX(d, 29, gpio, gpio)

/* pd29a_ebi_a17_ba1 */
#define PD29A_EBI_A17_BA1 \
	SAM_PINMUX(d, 29, a, periph)

/* pd30_gpio */
#define PD30_GPIO \
	SAM_PINMUX(d, 30, gpio, gpio)

/* pd30a_ebi_a18 */
#define PD30A_EBI_A18 \
	SAM_PINMUX(d, 30, a, periph)

/* pe0_gpio */
#define PE0_GPIO \
	SAM_PINMUX(e, 0, gpio, gpio)

/* pe0a_ebi_a19 */
#define PE0A_EBI_A19 \
	SAM_PINMUX(e, 0, a, periph)

/* pe1_gpio */
#define PE1_GPIO \
	SAM_PINMUX(e, 1, gpio, gpio)

/* pe1a_ebi_a20 */
#define PE1A_EBI_A20 \
	SAM_PINMUX(e, 1, a, periph)

/* pe2_gpio */
#define PE2_GPIO \
	SAM_PINMUX(e, 2, gpio, gpio)

/* pe2a_ebi_a21_nandale */
#define PE2A_EBI_A21_NANDALE \
	SAM_PINMUX(e, 2, a, periph)

/* pe3_gpio */
#define PE3_GPIO \
	SAM_PINMUX(e, 3, gpio, gpio)

/* pe3a_ebi_a22_nandcle */
#define PE3A_EBI_A22_NANDCLE \
	SAM_PINMUX(e, 3, a, periph)

/* pe4_gpio */
#define PE4_GPIO \
	SAM_PINMUX(e, 4, gpio, gpio)

/* pe4a_ebi_a23 */
#define PE4A_EBI_A23 \
	SAM_PINMUX(e, 4, a, periph)

/* pe5_gpio */
#define PE5_GPIO \
	SAM_PINMUX(e, 5, gpio, gpio)

/* pe5a_ebi_ncs4 */
#define PE5A_EBI_NCS4 \
	SAM_PINMUX(e, 5, a, periph)

/* pe6_gpio */
#define PE6_GPIO \
	SAM_PINMUX(e, 6, gpio, gpio)

/* pe6a_ebi_ncs5 */
#define PE6A_EBI_NCS5 \
	SAM_PINMUX(e, 6, a, periph)

/* pe7_gpio */
#define PE7_GPIO \
	SAM_PINMUX(e, 7, gpio, gpio)

/* pe8_gpio */
#define PE8_GPIO \
	SAM_PINMUX(e, 8, gpio, gpio)

/* pe9_gpio */
#define PE9_GPIO \
	SAM_PINMUX(e, 9, gpio, gpio)

/* pe9a_tc1_tioa3 */
#define PE9A_TC1_TIOA3 \
	SAM_PINMUX(e, 9, a, periph)

/* pe10_gpio */
#define PE10_GPIO \
	SAM_PINMUX(e, 10, gpio, gpio)

/* pe10a_tc1_tiob3 */
#define PE10A_TC1_TIOB3 \
	SAM_PINMUX(e, 10, a, periph)

/* pe11_gpio */
#define PE11_GPIO \
	SAM_PINMUX(e, 11, gpio, gpio)

/* pe11a_tc1_tioa4 */
#define PE11A_TC1_TIOA4 \
	SAM_PINMUX(e, 11, a, periph)

/* pe12_gpio */
#define PE12_GPIO \
	SAM_PINMUX(e, 12, gpio, gpio)

/* pe12a_tc1_tiob4 */
#define PE12A_TC1_TIOB4 \
	SAM_PINMUX(e, 12, a, periph)

/* pe13_gpio */
#define PE13_GPIO \
	SAM_PINMUX(e, 13, gpio, gpio)

/* pe13a_tc1_tioa5 */
#define PE13A_TC1_TIOA5 \
	SAM_PINMUX(e, 13, a, periph)

/* pe14_gpio */
#define PE14_GPIO \
	SAM_PINMUX(e, 14, gpio, gpio)

/* pe14a_tc1_tiob5 */
#define PE14A_TC1_TIOB5 \
	SAM_PINMUX(e, 14, a, periph)

/* pe15_gpio */
#define PE15_GPIO \
	SAM_PINMUX(e, 15, gpio, gpio)

/* pe15a_pwm_pwmh0 */
#define PE15A_PWM_PWMH0 \
	SAM_PINMUX(e, 15, a, periph)

/* pe16_gpio */
#define PE16_GPIO \
	SAM_PINMUX(e, 16, gpio, gpio)

/* pe16a_pwm_pwmh1 */
#define PE16A_PWM_PWMH1 \
	SAM_PINMUX(e, 16, a, periph)

/* pe16b_usart3_sck */
#define PE16B_USART3_SCK \
	SAM_PINMUX(e, 16, b, periph)

/* pe17_gpio */
#define PE17_GPIO \
	SAM_PINMUX(e, 17, gpio, gpio)

/* pe17a_pwm_pwml2 */
#define PE17A_PWM_PWML2 \
	SAM_PINMUX(e, 17, a, periph)

