zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam3XXh-pinctrl.h
/* pe18_gpio */
#define PE18_GPIO \
	SAM_PINMUX(e, 18, gpio, gpio)

/* pe18a_pwm_pwml0 */
#define PE18A_PWM_PWML0 \
	SAM_PINMUX(e, 18, a, periph)

/* pe18b_ebi_ncs6 */
#define PE18B_EBI_NCS6 \
	SAM_PINMUX(e, 18, b, periph)

/* pe19_gpio */
#define PE19_GPIO \
	SAM_PINMUX(e, 19, gpio, gpio)

/* pe19a_pwm_pwml4 */
#define PE19A_PWM_PWML4 \
	SAM_PINMUX(e, 19, a, periph)

/* pe20_gpio */
#define PE20_GPIO \
	SAM_PINMUX(e, 20, gpio, gpio)

/* pe20a_pwm_pwmh4 */
#define PE20A_PWM_PWMH4 \
	SAM_PINMUX(e, 20, a, periph)

/* pe20b_hsmci_mccdb */
#define PE20B_HSMCI_MCCDB \
	SAM_PINMUX(e, 20, b, periph)

/* pe21_gpio */
#define PE21_GPIO \
	SAM_PINMUX(e, 21, gpio, gpio)

/* pe21a_pwm_pwml5 */
#define PE21A_PWM_PWML5 \
	SAM_PINMUX(e, 21, a, periph)

/* pe22_gpio */
#define PE22_GPIO \
	SAM_PINMUX(e, 22, gpio, gpio)

/* pe22a_pwm_pwmh5 */
#define PE22A_PWM_PWMH5 \
	SAM_PINMUX(e, 22, a, periph)

/* pe22b_hsmci_mcdb0 */
#define PE22B_HSMCI_MCDB0 \
	SAM_PINMUX(e, 22, b, periph)

/* pe23_gpio */
#define PE23_GPIO \
	SAM_PINMUX(e, 23, gpio, gpio)

/* pe23a_pwm_pwml6 */
#define PE23A_PWM_PWML6 \
	SAM_PINMUX(e, 23, a, periph)

/* pe24_gpio */
#define PE24_GPIO \
	SAM_PINMUX(e, 24, gpio, gpio)

/* pe24a_pwm_pwmh6 */
#define PE24A_PWM_PWMH6 \
	SAM_PINMUX(e, 24, a, periph)

/* pe24b_hsmci_mcdb1 */
#define PE24B_HSMCI_MCDB1 \
	SAM_PINMUX(e, 24, b, periph)

/* pe25_gpio */
#define PE25_GPIO \
	SAM_PINMUX(e, 25, gpio, gpio)

/* pe25a_pwm_pwml7 */
#define PE25A_PWM_PWML7 \
	SAM_PINMUX(e, 25, a, periph)

/* pe26_gpio */
#define PE26_GPIO \
	SAM_PINMUX(e, 26, gpio, gpio)

/* pe26a_pwm_pwmh7 */
#define PE26A_PWM_PWMH7 \
	SAM_PINMUX(e, 26, a, periph)

/* pe26b_hsmci_mcdb2 */
#define PE26B_HSMCI_MCDB2 \
	SAM_PINMUX(e, 26, b, periph)

/* pe27_gpio */
#define PE27_GPIO \
	SAM_PINMUX(e, 27, gpio, gpio)

/* pe27a_ebi_ncs7 */
#define PE27A_EBI_NCS7 \
	SAM_PINMUX(e, 27, a, periph)

/* pe27b_hsmci_mcdb3 */
#define PE27B_HSMCI_MCDB3 \
	SAM_PINMUX(e, 27, b, periph)

/* pe28_gpio */
#define PE28_GPIO \
	SAM_PINMUX(e, 28, gpio, gpio)

/* pe28a_spi1_miso */
#define PE28A_SPI1_MISO \
	SAM_PINMUX(e, 28, a, periph)

/* pe29_gpio */
#define PE29_GPIO \
	SAM_PINMUX(e, 29, gpio, gpio)

/* pe29a_spi1_mosi */
#define PE29A_SPI1_MOSI \
	SAM_PINMUX(e, 29, a, periph)

/* pe30_gpio */
#define PE30_GPIO \
	SAM_PINMUX(e, 30, gpio, gpio)

/* pe30a_spi1_spck */
#define PE30A_SPI1_SPCK \
	SAM_PINMUX(e, 30, a, periph)

/* pe31_gpio */
#define PE31_GPIO \
	SAM_PINMUX(e, 31, gpio, gpio)

/* pe31a_spi1_npcs0 */
#define PE31A_SPI1_NPCS0 \
	SAM_PINMUX(e, 31, a, periph)

/* pf0_gpio */
#define PF0_GPIO \
	SAM_PINMUX(f, 0, gpio, gpio)

/* pf0a_spi1_npcs1 */
#define PF0A_SPI1_NPCS1 \
	SAM_PINMUX(f, 0, a, periph)

/* pf1_gpio */
#define PF1_GPIO \
	SAM_PINMUX(f, 1, gpio, gpio)

/* pf1a_spi1_npcs2 */
#define PF1A_SPI1_NPCS2 \
	SAM_PINMUX(f, 1, a, periph)

/* pf2_gpio */
#define PF2_GPIO \
	SAM_PINMUX(f, 2, gpio, gpio)

/* pf2a_spi1_npcs3 */
#define PF2A_SPI1_NPCS3 \
	SAM_PINMUX(f, 2, a, periph)

/* pf3_gpio */
#define PF3_GPIO \
	SAM_PINMUX(f, 3, gpio, gpio)

/* pf3a_pwm_pwmh3 */
#define PF3A_PWM_PWMH3 \
	SAM_PINMUX(f, 3, a, periph)

/* pf4_gpio */
#define PF4_GPIO \
	SAM_PINMUX(f, 4, gpio, gpio)

/* pf4a_usart3_cts */
#define PF4A_USART3_CTS \
	SAM_PINMUX(f, 4, a, periph)

/* pf5_gpio */
#define PF5_GPIO \
	SAM_PINMUX(f, 5, gpio, gpio)

/* pf5a_usart3_rts */
#define PF5A_USART3_RTS \
	SAM_PINMUX(f, 5, a, periph)
